# Naive Bayes Classifier

### 5)Write a program to implement the Na√Øve Bayes classifier for a sample training data set stored as a .CSV file. Compute the accuracy of the classifier, considering few test data sets.

In [20]:
import pandas as pd

In [21]:
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [23]:
inputs=df.drop('Survived',axis='columns')
target=df.Survived

In [24]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [25]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [26]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [27]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [28]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [29]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [33]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0
6       1  54.000000  51.8625       0
7       3   2.000000  21.0750       0
8       3  27.000000  11.1333       1
9       2  14.000000  30.0708       1

In [34]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.3)

In [35]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [36]:
model.fit(X_train,y_train)

GaussianNB()

In [37]:
model.score(X_test,y_test)

0.7723880597014925

In [38]:
X_test[0:10]

     Pclass   Age      Fare  female
690       1  31.0   57.0000       0
283       3  19.0    8.0500       0
373       1  22.0  135.6333       0
328       3  31.0   20.5250       1
236       2  44.0   26.0000       0
37        3  21.0    8.0500       0
210       3  24.0    7.0500       0
632       1  32.0   30.5000       0
659       1  58.0  113.2750       0
591       1  52.0   78.2667       1

In [39]:
y_test[0:10]

690    1
283    1
373    0
328    1
236    0
37     0
210    0
632    1
659    0
591    1
Name: Survived, dtype: int64

In [40]:
model.predict(X_test[0:10])

array([0, 0, 1, 0, 0, 0, 0, 0, 1, 1])

In [41]:
model.predict_proba(X_test[:10])

array([[0.55653004, 0.44346996],
       [0.96327378, 0.03672622],
       [0.00227674, 0.99772326],
       [0.55449079, 0.44550921],
       [0.92416535, 0.07583465],
       [0.96443467, 0.03556533],
       [0.96567654, 0.03432346],
       [0.72641228, 0.27358772],
       [0.02431184, 0.97568816],
       [0.01657815, 0.98342185]])

### Calculate the score using cross validation

In [42]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train,y_train,cv=5)

array([0.736     , 0.76      , 0.8       , 0.77419355, 0.7016129 ])